tutorials/CFD/17YJunction_Windkessel_2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| ========= | |
| \\ / F ield | OpenFOAM: The Open Source CFD Toolbox |
| \\ / O peration | Version: 1.5 |
| \\ / A nd | Web: http://www.OpenFOAM.org |
| \\/ M anipulation | |
\*---------------------------------------------------------------------------*/
FoamFile
{
version 2.0;
format ascii;
class dictionary;
object blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (1.31 -2 -15) //0
    (1.4142 -2 -15) //1
    (1.4142 2 -15) //2
    (1.31 2 -15) //3
    (1.31 -2 15) //4
    (1.4142 -2 15) //5
    (1.4142 2 15) //6
    (1.31 2 15) //7
    //(-1.4142 -1.4142 -15) //8
    //(1.4142 -1.4142 -15) //9
    //(1.4142 1.4142 -15) //10
    //(-1.4142 1.4142 -15) //11
    //(-1.4142 -1.4142 15) //12
    //(1.4142 -1.4142 15) //13
    //(1.4142 1.4142 15) //14
    //(-1.4142 1.4142 15) //15
);


blocks
(
    hex (0 1 2 3 4 5 6 7) (1 12 90) simpleGrading (1 1 1)
    //hex (3 2 10 11 7 6 14 15) (10 8 100) simpleGrading (1 1 1)
    //hex (2 1 9 10 6 5 13 14) (10 8 100) simpleGrading (1 1 1)
    //hex (1 0 8 9 5 4 12 13) (10 8 100) simpleGrading (1 1 1)
    //hex (0 3 11 8 4 7 15 12) (10 8 100) simpleGrading (1 1 1)
    
    //hex (0 1 2 3 4 5 6 7) (20 20 208) simpleGrading (1 1 1)
    //hex (3 2 10 11 7 6 14 15) (20 15 208) simpleGrading (1 1 1)
    //hex (2 1 9 10 6 5 13 14) (20 15 208) simpleGrading (1 1 1)
    //hex (1 0 8 9 5 4 12 13) (20 15 208) simpleGrading (1 1 1)
    //hex (0 3 11 8 4 7 15 12) (20 15 208) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 2 1)
            //(3 11 10 2)
            //(8 11 3 0)
            //(0 1 9 8)
            //(2 10 9 1)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (3 7 6 2)
	    (0 1 5 4)
	    //(15 11 8 12)
            //(13 12 8 9)
            //(9 10 14 13)
            //(11 15 14 10)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
            //(14 15 7 6)
            //(7 15 12 4)
            //(5 4 12 13)
            //(14 6 5 13)
        );
    }
);

