tutorials/CFD/17YJunction_Windkessel_2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          12;
        startFace       2058;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          180;
        startFace       2070;
    }
    outlet
    {
        type            patch;
        nFaces          12;
        startFace       2250;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2160;
        startFace       2262;
    }
)

// ************************************************************************* //
