tutorials/CFD/17YJunction_Windkessel_2D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


//internalField   nonuniform List<vector>
internalField   uniform (0 0 0); 
/*42000
(
(5.968383858e-07 5.968371892e-07 1.108884496e-08)
(5.345734532e-07 6.549322808e-07 4.18881819e-08)
(4.214673795e-07 6.958784409e-07 6.487604936e-08)
(2.695392341e-07 7.226646637e-07 7.921187579e-08)
(9.257423954e-08 7.362323252e-07 8.631969824e-08)
(-9.257391317e-08 7.362324442e-07 8.631972308e-08)
(-2.695389357e-07 7.226650258e-07 7.921195722e-08)
(-4.214670221e-07 6.958790309e-07 6.487619609e-08)
(-5.345730579e-07 6.549331105e-07 4.188837973e-08)
(-5.968375775e-07 5.968383525e-07 1.108901768e-08)
(6.549331476e-07 5.345727794e-07 4.188824014e-08)
(5.806370214e-07 5.806361147e-07 6.695999705e-08)
(4.573439685e-07 6.141521989e-07 8.629932507e-08)
(2.919706282e-07 6.362874943e-07 9.898590924e-08)
(1.002771801e-07 6.475087825e-07 1.054976815e-07)
(-1.00276862e-07 6.475089338e-07 1.054977083e-07)
(-2.91970303e-07 6.362879319e-07 9.898599278e-08)
(-4.573435812e-07 6.141528868e-07 8.629946351e-08)
(-5.80636497e-07 5.806368776e-07 6.696015602e-08)
(-6.549326453e-07 5.345734904e-07 4.188836837e-08)
(6.958791735e-07 4.214668585e-07 6.487605358e-08)
(6.141531022e-07 4.57343252e-07 8.629931222e-08)
(4.82452257e-07 4.82451483e-07 1.046078184e-07)
(3.076652221e-07 4.98996194e-07 1.173224043e-07)
(1.056421774e-07 5.072971708e-07 1.238920782e-07)
(-1.056418035e-07 5.072972673e-07 1.238921066e-07)
(-3.076648417e-07 4.989964721e-07 1.173224923e-07)
(-4.824518259e-07 4.824519033e-07 1.046079606e-07)
(-6.141525917e-07 4.573437185e-07 8.629948465e-08)
(-6.958787488e-07 4.214671997e-07 6.487622735e-08)
(7.226652476e-07 2.695387954e-07 7.921180005e-08)
(6.362882534e-07 2.919700371e-07 9.898584047e-08)
(4.989969191e-07 3.076645395e-07 1.173223564e-07)
(3.17943896e-07 3.17943197e-07 1.304277426e-07)
(1.091357726e-07 3.230676578e-07 1.372093971e-07)
(-1.091353658e-07 3.230676989e-07 1.372094336e-07)
(-3.179434843e-07 3.179433155e-07 1.304278507e-07)
(-4.989964779e-07 3.07664716e-07 1.173225299e-07)
(-6.362877711e-07 2.919702137e-07 9.89860552e-08)
(-7.226648633e-07 2.695389035e-07 7.921203795e-08)
(7.362327562e-07 9.257384011e-08 8.631955432e-08)
(6.475093523e-07 1.002766594e-07 1.054975544e-07)
(5.07297808e-07 1.056415395e-07 1.23891978e-07)
(3.230683451e-07 1.091350798e-07 1.372093414e-07)
(1.10872214e-07 1.108714837e-07 1.441048732e-07)
(-1.10871769e-07 1.108714815e-07 1.441049151e-07)
(-3.230678958e-07 1.091350708e-07 1.37209465e-07)
(-5.072973443e-07 1.056415221e-07 1.238921733e-07)
(-6.475088841e-07 1.00276613e-07 1.054978003e-07)
(-7.362323774e-07 9.257374715e-08 8.631983187e-08)
(7.362327276e-07 -9.257421707e-08 8.631951451e-08)
(6.475093011e-07 -1.002772866e-07 1.054975255e-07)
(5.072977943e-07 -1.056423726e-07 1.238919569e-07)
(3.230683567e-07 -1.091360278e-07 1.372093204e-07)
(1.108722298e-07 -1.108725145e-07 1.441048514e-07)
(-1.108717503e-07 -1.108725633e-07 1.441048933e-07)
(-3.230678734e-07 -1.0913617e-07 1.372094443e-07)
(-5.072973004e-07 -1.05642594e-07 1.238921535e-07)
(-6.475088092e-07 -1.002775731e-07 1.054977768e-07)
(-7.362323099e-07 -9.257452796e-08 8.631980382e-08)
(7.226651462e-07 -2.695390907e-07 7.921166786e-08)
(6.362880942e-07 -2.919705997e-07 9.898574707e-08)
(4.989968882e-07 -3.076653089e-07 1.173222894e-07)
(3.179439347e-07 -3.179440822e-07 1.304276793e-07)
(1.091358221e-07 -3.230686266e-07 1.372093335e-07)
(-1.091353116e-07 -3.230687238e-07 1.372093707e-07)
(-3.179434158e-07 -3.179443645e-07 1.304277894e-07)
(-4.989963566e-07 -3.076657472e-07 1.173224682e-07)
(-6.362875552e-07 -2.919711435e-07 9.898598313e-08)
(-7.226646512e-07 -2.69539658e-07 7.92119497e-08)
(6.958789642e-07 -4.214670063e-07 6.487579457e-08)
(6.141528878e-07 -4.573437055e-07 8.629913871e-08)
(4.824522342e-07 -4.824521268e-07 1.046076947e-07)
(3.076653041e-07 -4.98996943e-07 1.173222976e-07)
(1.056422683e-07 -5.072980073e-07 1.238919785e-07)
(-1.056417123e-07 -5.072981745e-07 1.238920105e-07)
(-3.0766474e-07 -4.989974261e-07 1.173223957e-07)
(-4.824516479e-07 -4.824528707e-07 1.046078582e-07)
(-6.14152281e-07 -4.573446136e-07 8.629936171e-08)
(-6.958783946e-07 -4.214678831e-07 6.487606769e-08)
(6.549329773e-07 -5.345732406e-07 4.188789632e-08)
(5.806368805e-07 -5.806365535e-07 6.695976388e-08)
(4.573440406e-07 -6.141527186e-07 8.629914805e-08)
(2.919707872e-07 -6.362880211e-07 9.898575575e-08)
(1.002773165e-07 -6.475093702e-07 1.054975467e-07)
(-1.002767501e-07 -6.47509624e-07 1.054975885e-07)
(-2.919702021e-07 -6.362887468e-07 9.898588029e-08)
(-4.573434185e-07 -6.14153821e-07 8.629934998e-08)
(-5.80636161e-07 -5.806378115e-07 6.696001922e-08)
(-6.549322593e-07 -5.345743904e-07 4.188818226e-08)
(5.968376144e-07 -5.968379044e-07 1.108859067e-08)
(5.345739454e-07 -6.549325498e-07 4.188798033e-08)
(4.214676979e-07 -6.958786e-07 6.48758202e-08)
(2.695395946e-07 -7.226648551e-07 7.921165946e-08)
(9.257445572e-08 -7.36232578e-07 8.631950996e-08)
(-9.25738301e-08 -7.362327829e-07 8.631956905e-08)
(-2.695389444e-07 -7.226654726e-07 7.921183603e-08)
(-4.214669523e-07 -6.958796181e-07 6.487610098e-08)
(-5.345730408e-07 -6.549338996e-07 4.188831219e-08)
...
)
;*/

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 1.877218546e-16);
    }
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
