tutorials/CFD/17YJunction_Windkessel_2D/0/Pippo_u1_nuovo
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Pippo_u1_nuovo;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
1080
(
(0 4.425360285e-08 6.504896024e-09)
(0 5.926556877e-07 3.907237097e-08)
(0 1.050977031e-06 5.171721054e-08)
(0 1.194136884e-06 1.281662941e-07)
(0 9.36828365e-07 2.089220604e-07)
(0 3.532438484e-07 2.560291725e-07)
(0 -3.532442292e-07 2.560291667e-07)
(0 -9.368286905e-07 2.089220438e-07)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 1.877218546e-16);
    }
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
