tutorials/CFD/17YJunction_Windkessel_2D/0/Ulift
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Ulift;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
1080
(
(0 0 0.9999999925)
(0 0 0.9999999925)
(0 0 0.9999999925)
(0 -1.500000224e-08 0.9999999925)
(0 -1.500000224e-08 1.000000008)
(0 0 1.000000008)
(0 0 0.9999999925)
(0 0 0.9999999925)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 1);
    }
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
