tutorials/CFD/17YJunction_Windkessel_2D/system/ITHACAdict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      ITHACAdict;
}

// EigenValue solver, can be eigen or spectra
EigenSolver eigen;

// Number of modes to output and to use for projection
NmodesUout 10;
NmodesUproj 3;

NmodesPout 10;
NmodesPproj 3;

NmodesSUPout 10;
NmodesSUPproj 4;

timeDerivativeSchemeOrder second;

bcMethod lift;
timedepbcMethod yes;
Add_liftfieldP yes;
timedepbcMethod_P yes;
// Output format to save market vectors.
OutPrecision 15;
OutType fixed;
