tutorials/CFD/17YJunction_Windkessel_2D/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory


# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

//runApplication blockMesh
runApplication /scratch/psiena/cardio_rom/solvers/Cylinder/cylinder
# ----------------------------------------------------------------- end-of-file
